<a href="https://colab.research.google.com/github/helloKH/Psypy/blob/master/Psypy_Data%20Load%20%26%20Preparations(Chapter%206%20~7).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Psypy 6회차 
- 데이터 로딩과 저장, 파일의 형식(Chapter 6) 
- 데이터 정제 및 준비(Chapter 7)
- 참고자료: Python for Data Analysis 2nd.

### Chapter6 데이터 로딩과 저장, 파일 형식

In [1]:
!python -V

Python 3.6.9

#### 0. Google Drive와 연결하여 데이터 업로드해두기
- 참고 문서 링크: https://www.marktechpost.com/2019/06/07/how-to-connect-google-colab-with-google-drive/

In [78]:
from google.colab import drive
drive.mount('/content/gdrive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/gdrive

#### URL로 가서 authorization code를 아래 code 입력란에 copy and paste. 마운트 위치는 /content/gdrive/My Drive/ 이렇게 됨.

In [79]:
!ls '/content/gdrive/My Drive/' # 유닉스 명령어 ls를 사용하여 폴더에 있는 파일 리스트를 확인 가능

 Aimmed  'Colab Notebooks'   psypy   pydata-book

#### 자신의 구글 드라이브에 디렉토리를 만들어서 거기에 필요한 파일들을 업로드
- 교재에서 사용되는 파일들은 아래 링크에 존재
- https://github.com/wesm/pydata-book/tree/2nd-edition/examples

In [80]:
import os
os.getcwd()
os.chdir('/content/gdrive/My Drive/pydata-book') #경로 변경
os.getcwd()

'/content/gdrive/My Drive/pydata-book'

In [0]:
import urllib.request

url = 'https://raw.githubusercontent.com/wesm/pydata-book/2nd-edition/examples/ex1.csv'
file_name = "examples/ex1.csv" 
with urllib.request.urlopen(url) as r:
  doc = r.read()
  with open(file_name, "wb") as f:
    f.write(doc)

In [81]:
# 제대로 만들어서 업로드했으면 다음처럼 확인할 수 있다.
!ls '/content/gdrive/My Drive/pydata-book'

appa.ipynb  ch05.ipynb	ch09.ipynb  ch13.ipynb	examples       README.md
ch02.ipynb  ch06.ipynb	ch10.ipynb  ch14.ipynb	mydata.h5      requirements.txt
ch03.ipynb  ch07.ipynb	ch11.ipynb  COPYING	mydata.sqlite
ch04.ipynb  ch08.ipynb	ch12.ipynb  datasets	pydata-book

In [0]:
# 실습을 위한 소스와 데이터가 있는 저장소를 클로닝해서 colab과 동기화하는 방법을 사용.
# 지금은 클로닝되어 있지 않음
%ls

appa.ipynb  ch05.ipynb  ch09.ipynb  ch13.ipynb  examples/
ch02.ipynb  ch06.ipynb  ch10.ipynb  ch14.ipynb  README.md
ch03.ipynb  ch07.ipynb  ch11.ipynb  COPYING     requirements.txt
ch04.ipynb  ch08.ipynb  ch12.ipynb  datasets/

In [0]:
# 저장소 가져옴
!git clone https://github.com/wesm/pydata-book.git

Cloning into 'pydata-book'...
remote: Enumerating objects: 431, done.
remote: Total 431 (delta 0), reused 0 (delta 0), pack-reused 431
Receiving objects: 100% (431/431), 40.54 MiB | 11.03 MiB/s, done.
Resolving deltas: 100% (132/132), done.
Checking out files: 100% (210/210), done.

In [0]:
# 코드&데이터 디렉토리 확인
%ls

appa.ipynb  ch05.ipynb  ch09.ipynb  ch13.ipynb  examples/
ch02.ipynb  ch06.ipynb  ch10.ipynb  ch14.ipynb  pydata-book/
ch03.ipynb  ch07.ipynb  ch11.ipynb  COPYING     README.md
ch04.ipynb  ch08.ipynb  ch12.ipynb  datasets/   requirements.txt

In [0]:
#colab의 실행 위치를 examples 디렉토리 내부로 옮기자
%cd examples

/content/gdrive/My Drive/pydata-book/examples

In [0]:
os.getcwd()

'/content/gdrive/My Drive/pydata-book/examples'

In [0]:
%ls

array_ex.txt    ex4.csv                     macrodata.csv   test_file.csv
csv_mindex.csv  ex5.csv                     out.csv         tips.csv
ex1.csv         ex6.csv                     segismundo.txt  tseries.csv
ex1.xlsx        ex7.csv                     spx.csv         volume.csv
ex2.csv         example.json                stinkbug.png    yahoo_price.pkl
ex3.csv         fdic_failed_bank_list.html  stock_px_2.csv  yahoo_volume.pkl
ex3.txt         ipython_bug.py              stock_px.csv

In [0]:
%cat ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

### 6 데이터 로딩과 저장, 파일형식

In [0]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

#### 6.1 텍스트파일에서 데이터 읽고 쓰기

In [0]:
!cat ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [0]:
# 설정된 폴더 내에서 data를 직접 불러온다
df = pd.read_csv('ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [0]:
#read_table 에 구분자로 쉼표를 지정해서 읽어올 수 있다
pd.read_table('ex1.csv', sep = ',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

- 파일 컬럼에 이름이 없는 경우

In [0]:
pd.read_table('ex2.csv')

    1,2,3,4,hello
0   5,6,7,8,world
1  9,10,11,12,foo

- pandas 가 자동으로 컬럼 이름 생성하게 만들거나, 이름 지정하기

In [0]:
pd.read_csv('ex2.csv', header = None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [0]:
pd.read_csv('ex2.csv', names = ['a', 'b', 'c', 'd', 'message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [0]:
names = ['a', 'b', 'c', 'd', 'message']
pd.read_csv('ex2.csv', names = names, index_col = 'message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

- 계층적 색인을 지정하기 위해 컬럼 번호나 이름의 리스트를 넘기기

In [0]:
parsed = pd.read_csv('csv_mindex.csv', index_col = ['key1', 'key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

- 고정된 구분자 없이 공백이나 다른 패턴으로 필드를 구분한 경우
  - 정규표현식으로 고치기

In [0]:
result = pd.read_table('ex3.txt', sep = '\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

- 누락된 값 확인하기

In [0]:
result = pd.read_csv('ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [0]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

- na-values 옵션은 리스트나 문자열 집합을 받아서 누락된 값을 처리한다

In [0]:
result = pd.read_csv('ex5.csv', na_values = ['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [0]:
sentinels = {'message': ['foo', 'NA'], 'something': ['two']}
pd.read_csv('ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

#### 6.1.1 텍스트파일 조금씩 읽어오기

In [0]:
result = pd.read_csv('ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [0]:
pd.read_csv('ex6.csv', nrows = 5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

- chunksize 옵션으로 row 개수를 나눠서 읽을 수 있다

In [0]:
chunker = pd.read_csv('ex6.csv', chunksize= 1000)

# TextParser 객체를 이용해 chunksize에 따라 분리된 파일들을 순회 가능
# ex6.csv 파일을 순회하면서 key 값 세어보기

tot = pd.Series([])

for piece in chunker:
  tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending = False)

In [0]:
tot[:10]

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

#### 6.1.2 데이터를 텍스트 형식으로 기록
- 읽어오기와 마찬가지로 데이터를 구분자로 내보내는 것도 가능

In [0]:
data = pd.read_csv('ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

- to.csv 메서드를 이용하면 데이터를 쉼표로 구분된 형식으로 파일에 쓸 수 있음

In [0]:
data.to_csv('ex5.csv')
!cat out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

- 다른 구분자도 가능(콘솔에서 확인 가능하도록 실제 파일로 기록하지 않고, sys.stdout에 기록)

In [0]:
import sys

data.to_csv(sys.stdout, sep = '|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

- 결과에서 누락된 값은 빈 문자열로 나타나는데, 원하는 값으로 지정 가능

In [0]:
data.to_csv(sys.stdout, na_rep = 'NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

- row, column 이름 포함하지 않기

In [0]:
data.to_csv(sys.stdout, index = False, header = False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

- 일부기록 혹은 순서 지정

In [0]:
data.to_csv(sys.stdout, index = False, columns = ['a', 'b', 'c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

#### 6.1.3 구분자 형식 다루기

- 파일을 읽듯이 reader을 순회하면 큰따옴표가 제거된 튜플 획득 가능

In [0]:
data = pd.read_csv('ex7.csv')
data

   a  b  c
0  1  2  3
1  1  2  3

- 구분자가 한 글자인 파일은 파이썬 내장 csv 모듈로 처리할 수 있는데, 열려진 파일 객체를 csv.reader로 넘기면 됨

In [0]:
import csv
f = open('ex7.csv')
reader = csv.reader(f)

for line in reader:
  print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

- 파일을 읽어줄 단위를 리스트로 저장하고, 헤더와 데이터를 구분한다

In [0]:
with open('ex7.csv') as f:
  lines = list(csv.reader(f))

header, values = lines[0], lines[1:]

- 사전 표기법과 row를 컬럼으로 전치해주는 zip(*values)를 이용하여 데이터 컬럼 사전을 만들 수 있다

In [0]:
data_dict = {h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

#### 6.1.4 JSON 데이터 
- JSON은 웹브라이저와 다른 애플리케이션이 HTTP 요청으로 데이터를 보낼 때 널리 사용하는 표준 파일 형식. JSON은 CSV 같은 표 형식보다 더 유연함

In [0]:
#예시
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

- JSON은 일부를 제외하면 파이썬 코드와 유사. 객체의 키는 반드시 문자열이어야 함
- 파이썬 표준 라이브러리인 json를 통해 다룰 수 있음

In [0]:
import json
result = json.loads(obj)
result

{'name': 'Wes',
 'pet': None,
 'places_lived': ['United States', 'Spain', 'Germany'],
 'siblings': [{'age': 30, 'name': 'Scott', 'pets': ['Zeus', 'Zuko']},
  {'age': 38, 'name': 'Katie', 'pets': ['Sixes', 'Stache', 'Cisco']}]}

- json.dumps는 파이썬 객체를 json 형태로 변환

In [0]:
asjson = json.dumps(result)
asjson

'{"name": "Wes", "places_lived": ["United States", "Spain", "Germany"], "pet": null, "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]}, {"name": "Katie", "age": 38, "pets": ["Sixes", "Stache", "Cisco"]}]}'

- 객체의 리스트를 사전을 담고 있는 리스트로 변환, DataFrame 생성자로 넘기고 데이터 필드 선택 가능

In [0]:
siblings = pd.DataFrame(result['siblings'], columns = ['name', 'age'])
siblings

    name  age
0  Scott   30
1  Katie   38

In [0]:
!cat example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

- 별다른 옵션이 없을 경우 pd.read_json는 JSON 배열에 담긴 각 객체를 테이블의 row로 간주

In [0]:
data = pd.read_json('example.json')
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

- pandas의 데이터를 json으로 저장하는 방법 중 하나는 Series 혹은 to_json 함수를 이용하는 것

In [0]:
print(data.to_json())
print(data.to_json(orient='records'))

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}
[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

#### 6.1.5 XML 과 HTML: 웹 스크래핑

- 파이썬에는 lxml, Beautiful Soup, html5lib 과 같은 HTML과 XML 형식의 데이터를 읽고 쓸 수 있는 라이브러리 존재. 
- lxml은 가장 빠르게 동작하고, 꺠진 HTML, XML 파일도 처리해줌
- read_html은 lxml, Beautiful Soup 같은 라이브러리를 통해 자동으로 HTML을 파싱하여 DataFrame으로 변환해줌

- 미연방예금공사에서 부도은행을 보여주는 data

In [0]:
tables = pd.read_html('fdic_failed_bank_list.html')
print(len(tables))
failures = tables[0]
failures.head()

1

                      Bank Name  ...       Updated Date
0                   Allied Bank  ...  November 17, 2016
1  The Woodbury Banking Company  ...  November 17, 2016
2        First CornerStone Bank  ...  September 6, 2016
3            Trust Company Bank  ...  September 6, 2016
4    North Milwaukee State Bank  ...      June 16, 2016

[5 rows x 7 columns]

- 데이터 정제 및 연도별 부도은행 수

In [0]:
print(data.to_json())
print(data.to_json(orient='records'))

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}
[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

- lxml.objectify를 통해 XML 파싱하기
  - XML은 계층적 구조와 메타데이터를 포함한 중접된 데이터 구조를 지원
  - 뉴욕 MTA(버스, 지하철 운영 자료) 예시

In [0]:
# examples에는 Performance_MNR.xml가 없다
os.chdir('/content/gdrive/My Drive/pydata-book') #윗 단으로 경로 변경

In [0]:
from lxml import objectify

path = 'datasets/mta_perf/Performance_MNR.xml'
parsed = objectify.parse(open(path))
root = parsed.getroot()

- root.INDICATOR를 이용해서 모든 <INDICATOR> 엘리먼트를 끄집어낼 수 있다. 각 항목에 대한 몇몇 태그는 제외하고 태그 이름을 키값으로 하는 사전을 만들 수 있다

In [0]:
data = []

skip_fields = ['PARENT_SEQ', 'INDICATOR_SEQ',
               'DESIRED_CHANGE', 'DECIMAL_PLACES']

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

- 사전 리스트를 DataFrame으로 전환

In [0]:
perf = pd.DataFrame(data)
perf.head()

            AGENCY_NAME  ... MONTHLY_ACTUAL
0  Metro-North Railroad  ...           96.9
1  Metro-North Railroad  ...             95
2  Metro-North Railroad  ...           96.9
3  Metro-North Railroad  ...           98.3
4  Metro-North Railroad  ...           95.8

[5 rows x 12 columns]

- XML 데이터는 예제보다 더 복잡. 유효한 XML 형식인 HTML의 a 태그를 생각하면 됨

In [0]:
from io import StringIO
tag = '<a href="http://www.google.com">Google</a>'
root = objectify.parse(StringIO(tag)).getroot()

In [0]:
root
root.get('href')
root.text

'Google'

#### 6.2 이진 데이터 형식
- 데이터를 효율적으로 저장하는 가장 손쉬운 방법은 파이썬에 내장된 pickle **직렬화**를 사용해 데이터를 저장하는 것
- pandas는 pickle를 이용해 데이터를 저장하는 to_pickle 메서드를 가지고 있음

In [0]:
frame = pd.read_csv('examples/ex1.csv')
frame
frame.to_pickle('examples/frame_pickle')

- 내장 함수인 pickle로 직접 불러오거나, pandas.read_pickle 메서드 사용가능

In [0]:
pd.read_pickle('examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

#### 6.2.1 HDF5 형식 사용하기
- 대량의 과학계산용 배열 데이터 저장을 위해 고안된 파일 포멧
- C 라이브러리로도 존재하며 자바, 줄리아, 매트랩, 파이썬 같은 다양한 다른 언어에서도 사용 가능한 인터페이스 제공
- 계층적 데이터라는 뜻
- 각각의 HDF5 파일은 여러 개이 데이터셋을 저장, 부가 정보 기록 가능
- 실시간 압축을 지원하며, 반복 패턴 데이터를 좀 더 효과적으로 저장 가능
- HDFStore 클래스는 사전처럼 작동하며, 세밀한 요구사항도 처리해줌

In [0]:
frame = pd.DataFrame({'a': np.random.randn(100)})
store = pd.HDFStore('mydata.h5')
store['obj1'] = frame
store['obj1_col'] = frame['a']
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

- HDF5에 저장된 객체는 사전과 유사하게 작동한다

In [0]:
store['obj1']

           a
0   0.826438
1  -1.312611
2  -0.355818
3   0.316383
4   0.765587
..       ...
95  0.410142
96  0.658948
97  0.222593
98  1.909154
99 -2.646851

[100 rows x 1 columns]

- pandas.read_hdf로 사용 가능

In [0]:
frame.to_hdf('mydata.h5', 'obj3', format='table')
pd.read_hdf('mydata.h5', 'obj3', where=['index < 5'])

          a
0  0.826438
1 -1.312611
2 -0.355818
3  0.316383
4  0.765587

#### 6.2.2 엑셀 데이터 불러오기

- ExcelFile 클래스나 pandas.read_excel로 엑셀 2003 이후 데이터 읽어올 수 있음
- 내부적으로 XLS 파일과 XLSX 파일을 읽기 위해 xlrd 와 openpyxl 패키시를 사용하므로 사전에 pip이나 conda 명령어로 처리해줘야 한다

In [0]:
xlsx = pd.ExcelFile('examples/ex1.xlsx')

In [0]:
pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

- ExcelFile 생성하지 않고, 간단하게 read_excel에 파일 이름 넘겨서 여러 시트 읽기

In [0]:
frame = pd.read_excel('examples/ex1.xlsx', 'Sheet1')
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

- pandas 데이터를 엑셀 파일로 저장하려면 ExcelWrite를 생성해서 데이터를 기록하고 pandas 객체의 to_excel로 넘긴다

In [0]:
writer = pd.ExcelWriter('examples/ex2.xlsx')
frame.to_excel(writer, 'Sheet1')
writer.save()

- ExcelWriter를 사용하지 않고 to_excel로 메서드에 파일 경로만 넘겨도 된다

In [0]:
frame.to_excel('examples/ex2.xlsx')

#### 6.3 웹 API와 함께 사용하기
- 데이터 피드를 JSON과 함께 여타 다른 형식으로 얻을 수 있는 공개 API를 제공하는 웹사이트가 있다. 파이썬으로 API를 사용하는 가장 손쉬운 방법은 requests 패키지를 이용하는 것

In [0]:
import requests
url = 'https://api.github.com/repos/pandas-dev/pandas/issues'
resp = requests.get(url)
resp

- 응답 객체의 json 메서드는 JSON의 내용을 파이썬 사전 형태로 변환한 객체 반환

In [0]:
data = resp.json()
data[0]['title']

'CLN: convert str.format() to f-string'

- data를 DataFrame로 생성하고, 관심 있는 필드만 따로 추출할 수 있다

In [0]:
issues = pd.DataFrame(data, columns=['number', 'title',
                                     'labels', 'state'])
issues.head()

   number  ... state
0   30141  ...  open
1   30140  ...  open
2   30139  ...  open
3   30138  ...  open
4   30137  ...  open

[5 rows x 4 columns]

#### 6.4 데이터베이스와 함꼐 사용
- 비지니스 관점에서는 대부분 데이터를 텍스트나 엑셀 파일로 저장하지 않고, SQL 기반 관계형데이터베이스를 많이 사용한다.
- SQL에서 데이터를 읽어와서 DataFrame에 저장하는 것은 직관적이며, pandas는 이 과정을 간결하게 해주는 몇 가지 함수가 있다. 내장 함수 sqlite3 을 사용해 SQLife 데이터베이스 이용 가능

In [0]:
import sqlite3
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20),
 c REAL,        d INTEGER
);"""
con = sqlite3.connect('mydata.sqlite')
con.execute(query)
con.commit()

- 데이터 입력

In [0]:
data = [('Atlanta', 'Georgia', 1.25, 6),
        ('Tallahassee', 'Florida', 2.6, 3),
        ('Sacramento', 'California', 1.7, 5)]
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"
con.executemany(stmt, data)
con.commit()

- select 쿼리를 수행하면 튜플 리스트를 반환

In [0]:
cursor = con.execute('select * from test')
rows = cursor.fetchall()
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

- 반환된 튜플 리스트를 DataFrame 생성자에 전달하지 않고, 컬럼 이름을 지정하기

In [0]:
cursor.description
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

- read_sql를 통해 SQLAlchemy 의 일반적 연결을 넘어 쉽게 데이터 읽기
- SQLAlchemy로 같은 SQLite 에 접속하고 앞서 만든 테이블에서 데이터 읽어오기

In [0]:
import sqlalchemy as sqla
db = sqla.create_engine('sqlite:///mydata.sqlite')
pd.read_sql('select * from test', db)

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

### Chapter 7 데이터 정제 및 준비

In [0]:
import pandas as pd
import numpy as np

#### 7.1 누락 데이터 처리

- 산술데이터에 한해 누락된 데이터를 NaN으로 취급

In [6]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])
print(string_data)
string_data.isnull()

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

0    False
1    False
2     True
3    False
dtype: bool

- pandas에서는 R의 결측치를 NA 취급하는 개념 차용
- 파이썬의 내장 None 값 또한 NA 취급

In [7]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

#### 7.1.1 누락된 데이터 골라내기

- pandas.isnull 이나 dropna 추천

In [9]:
from numpy import nan as NA
data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

- dropna는 NA를 하나라도 가지고 있으면 row 제외

In [12]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
print(data)
cleaned

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

     0    1    2
0  1.0  6.5  3.0

- how= 'all' 옵션을 넘기면 모두 NA 값인 row만 제외

In [13]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

- 컬럼을 제외시키는 방법도 동일. 옵션으로 axis = 1을 넘겨주면 됨

In [14]:
data[4] = NA
data
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

- DataFrame의 row를 제외시키는 방법은 주로 시계열 데이터에 사용됨
- 몇 개 이상의 값이 들어있는 row만 보고 싶을 경우 thresh 인자에 원하는 값 넘겨줌

In [16]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
df

          0         1         2
0 -0.533728       NaN       NaN
1 -0.930360       NaN       NaN
2  0.716990       NaN  1.098871
3 -0.905171       NaN -0.052534
4  1.035141 -0.261602  1.115968
5 -1.645444 -1.389202  0.931956
6  0.337989 -0.897559 -0.408570

In [17]:
df.dropna()

          0         1         2
4  1.035141 -0.261602  1.115968
5 -1.645444 -1.389202  0.931956
6  0.337989 -0.897559 -0.408570

In [18]:
df.dropna(thresh=2)

          0         1         2
2  0.716990       NaN  1.098871
3 -0.905171       NaN -0.052534
4  1.035141 -0.261602  1.115968
5 -1.645444 -1.389202  0.931956
6  0.337989 -0.897559 -0.408570

#### 7.1.2 결측치 채우기

- fillna 메서드 활용
- 채워주고 싶은 값을 넘겨주면 됨

In [19]:
df.fillna(0)

          0         1         2
0 -0.533728  0.000000  0.000000
1 -0.930360  0.000000  0.000000
2  0.716990  0.000000  1.098871
3 -0.905171  0.000000 -0.052534
4  1.035141 -0.261602  1.115968
5 -1.645444 -1.389202  0.931956
6  0.337989 -0.897559 -0.408570

- fillna에 사전 값을 넘겨서 각 컬럼마다 다른 값을 채울 수 있음

In [20]:
df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.533728  0.500000  0.000000
1 -0.930360  0.500000  0.000000
2  0.716990  0.500000  1.098871
3 -0.905171  0.500000 -0.052534
4  1.035141 -0.261602  1.115968
5 -1.645444 -1.389202  0.931956
6  0.337989 -0.897559 -0.408570

- fillna 를 통해 기존 객체를 변경 가능

In [21]:
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.533728  0.000000  0.000000
1 -0.930360  0.000000  0.000000
2  0.716990  0.000000  1.098871
3 -0.905171  0.000000 -0.052534
4  1.035141 -0.261602  1.115968
5 -1.645444 -1.389202  0.931956
6  0.337989 -0.897559 -0.408570

- 재색인에서 사용 가능한 보간 메서드는 fillna 메서드에서도 사용 가능

In [25]:
df = pd.DataFrame(np.random.randn(6, 3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA
df

          0         1         2
0  0.812546 -1.742352 -1.330862
1 -0.412974  0.488887  0.055074
2 -1.934399       NaN -0.299630
3  0.347106       NaN  0.130714
4  1.315723       NaN       NaN
5  0.521119       NaN       NaN

In [23]:
df.fillna(method='ffill')  # method는 보간 방식. 기본적으로 ffill 사용

          0         1         2
0 -0.200454 -1.319906 -0.613892
1  1.136678  0.654330 -0.099664
2 -1.158454  0.654330 -1.781541
3 -0.154156  0.654330  0.002635
4  0.232058  0.654330  0.002635
5  0.576630  0.654330  0.002635

In [24]:
df.fillna(method='ffill', limit=2) # limit = 값을 앞 혹은 뒤에서부터 몇 개까지 채울지 결정

          0         1         2
0 -0.200454 -1.319906 -0.613892
1  1.136678  0.654330 -0.099664
2 -1.158454  0.654330 -1.781541
3 -0.154156  0.654330  0.002635
4  0.232058       NaN  0.002635
5  0.576630       NaN  0.002635

- 창의적 응용 가능(Series의 평균이나 중간값 제공 가능)

In [26]:
data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

#### 7.2 데이터 변형

#### 7.2.1 중복 제거

In [27]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

- duplicated는 각 row가 중복인지 아닌지 알려주는 불리언 Series를 반환

In [28]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

- drop_duplicates는 duplicated 배열이 False인 DataFrame 반환

In [29]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

- 부분합 설정 가능. 
- 새로운 컬럼을 하나 추가하고, 'k1' 컬럼에 기반해서 중복 걸러내기

In [30]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

- duplicated 와 drop_duplicates는 기본적으로 처음 발견된 값 유지. keep = 'last' 옵션을 넘기면 마지막 발견된 값 반환

In [31]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

#### 7.2.2 함수나 매핑을 이용해서 데이터 변형

In [32]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

- 육류가 어떤 동물의 고기인지 알려주는 칼럼 추가

In [0]:
# 육류별 동물 담긴 사전데이터 생성
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

- 육류 이름 모두 소문자로 전환

In [34]:
lowercased = data['food'].str.lower()
lowercased
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

- map 메서드를 한 객체 안에서 값의 부분집합을 변경하는데 사용 가능

In [35]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

#### 7.2.3 값 치환

- replace 메서드는 map 메서드와 동일한 역할을 좀 더 간단하고 유연하게 제공

In [36]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

- replace 메서드로 -999(누락된 데이터를 나타내기 위한 값)을 NA로 치환한 새로운 Series로 생성 가능(단, inplace=True로 인자를 넘기지 않았을 경우)

In [37]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

- 여러 개의 값 한 번에 치환(list)

In [38]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

- 누락된 값 대신 새로 지정할 값 리스트 사용하기

In [39]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [40]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

#### 7.2.4 축 색인 바꾸기

- Series의 값들처럼 축 이름 역시 유사한 방식으로 함수나 새롭게 바꿀 값 이용하여 변환 가능. 새로운 자료구조 만들지 않고 그 자리에서 가능

In [0]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=['Ohio', 'Colorado', 'New York'],
                    columns=['one', 'two', 'three', 'four'])

In [43]:
transform = lambda x: x[:4].upper()
data.index.map(transform) # map 사용 가능

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

- 대문자로 변경된 축 이름을 index에 대입

In [45]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

- 원래 객체 변경없이 새 객체를 만드려면 rename 메서드 사용

In [46]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

- rename은 사전 형식의 객체로 축 이름 중 일부만 변경 가능

In [47]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [48]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

#### 7.2.5 개별화와 양자화

- 연속성 데이터는 종종 개별로 분할하거나 그룹별로 분리

In [0]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

- cut 함수로 18-25, 26-35, 35-60, 60 이상으로 분리

In [51]:
bins = [18, 25, 35, 60, 100]
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

- pandas 에서 반환하는 객체는 Categorical이라는 특수한 객체. 
- pandas.cut으로 계산된 것으로, 그룹 이름이 담긴 배열이라고 생각할 것
- codes 속성에 있는 ages 데이터에 대한 카테고리 이름을 categories라는 배열에 내부적으로 담고 있음

In [54]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [55]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [56]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

- 간격을 나타내는 표기법은 중괄호로 시작해서 대괄호로 끝남.
- 중괄호 쪽의 값은 포함하지 않고 대괄호는 포함하는 간격을 나타냄
- right = False를 통해 중괄호 대신 대괄호가 포함되지 않게끔 바꿀 수 있음

In [57]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

- labels 옵션으로 그룹 이름을 직접 넘길 수 있음

In [58]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

- cut 함수에 명시적으로 그룹의 경계값 없이 개수를 넘기면, 최솟값과 최댓값 기준으로 균등한 길이로 그룹을 계산

In [59]:
data = np.random.rand(20)
pd.cut(data, 4, precision=2)

[(0.052, 0.26], (0.67, 0.88], (0.052, 0.26], (0.26, 0.46], (0.67, 0.88], ..., (0.26, 0.46], (0.052, 0.26], (0.26, 0.46], (0.46, 0.67], (0.67, 0.88]]
Length: 20
Categories (4, interval[float64]): [(0.052, 0.26] < (0.26, 0.46] < (0.46, 0.67] < (0.67, 0.88]]

- qcut은 표본 변위치 기반 데이터 분리.

In [61]:
data = np.random.randn(1000)  # 정규분포 생성
cats = pd.qcut(data, 4)  # 4분위수 분류
print(cats)
pd.value_counts(cats)

[(0.63, 3.027], (0.63, 3.027], (-0.0548, 0.63], (-0.0548, 0.63], (0.63, 3.027], ..., (-2.937, -0.776], (-2.937, -0.776], (-0.776, -0.0548], (-0.776, -0.0548], (-0.0548, 0.63]]
Length: 1000
Categories (4, interval[float64]): [(-2.937, -0.776] < (-0.776, -0.0548] < (-0.0548, 0.63] <
                                    (0.63, 3.027]]

(0.63, 3.027]        250
(-0.0548, 0.63]      250
(-0.776, -0.0548]    250
(-2.937, -0.776]     250
dtype: int64

- 변위치 직접 지정

In [62]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.0548, 1.307], (1.307, 3.027], (-0.0548, 1.307], (-0.0548, 1.307], (1.307, 3.027], ..., (-2.937, -1.334], (-1.334, -0.0548], (-1.334, -0.0548], (-1.334, -0.0548], (-0.0548, 1.307]]
Length: 1000
Categories (4, interval[float64]): [(-2.937, -1.334] < (-1.334, -0.0548] < (-0.0548, 1.307] <
                                    (1.307, 3.027]]

#### 7.2.6 특이값 찾기 및 제외하기

In [63]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.020308    -0.013728    -0.006131    -0.002001
std       0.991472     1.023439     0.985932     0.994175
min      -3.314513    -4.198156    -3.380071    -3.460590
25%      -0.710292    -0.668796    -0.675072    -0.641059
50%      -0.022553    -0.052501    -0.030894    -0.039205
75%       0.671265     0.659176     0.644480     0.668457
max       3.775906     3.991993     2.948781     3.110334

- 임의의 1개 컬럼에서 절대값 3초과 찾기

In [64]:
col = data[2]
col[np.abs(col) > 3]

464   -3.087563
686   -3.306729
967   -3.380071
Name: 2, dtype: float64

- 모든 row를 찾으려면 불리언 DataFrame에서 any 메서드 사용

In [65]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
206  1.027776  3.296329  1.525887  0.964341
246  1.191824 -3.468235  0.448053  0.235863
260  0.146143  3.075327  0.028115 -1.238184
396  3.775906  0.137844  1.620006  0.147155
464 -0.861641 -0.491769 -3.087563  0.368271
540 -1.305890 -0.111068  0.279879  3.110334
596 -0.941749  3.991993 -0.526250 -2.876415
640 -1.791171 -1.236888 -0.093559 -3.460590
686  1.838916  0.259883 -3.306729 -0.715099
694 -0.109032 -4.198156  0.326549 -0.325973
862 -3.314513 -2.399758  0.621068  0.170971
967 -1.456278 -1.836954 -3.380071 -0.170643

In [66]:
data[np.abs(data) > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.020770    -0.013426    -0.005356    -0.001651
std       0.987799     1.013164     0.983450     0.992337
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.710292    -0.668796    -0.675072    -0.641059
50%      -0.022553    -0.052501    -0.030894    -0.039205
75%       0.671265     0.659176     0.644480     0.668457
max       3.000000     3.000000     2.948781     3.000000

- np.sign(data)는 data 값이 양수/음수에 따라 1이나 -1이 담긴 배열 반환

In [67]:
np.sign(data).head()

     0    1    2    3
0 -1.0 -1.0  1.0 -1.0
1  1.0  1.0  1.0 -1.0
2  1.0  1.0  1.0 -1.0
3  1.0  1.0 -1.0  1.0
4  1.0  1.0 -1.0  1.0

#### 7.2.7 치환과 임의 샘플링

- numpy.random.permutation 함수를 사용하면 Series나 DataFrame의 row를 쉽게 임의 순서대로 재배치 가능. 순서를 바꾸고 싶은 만큼의 길이를 permutation으로 넘기면 바뀐 순서가 담긴 정수배열 생성

In [68]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
sampler = np.random.permutation(5)
sampler

array([2, 4, 1, 3, 0])

- iloc 기반 색인이나 take 함수에서 사용 가능

In [69]:
df
df.take(sampler)

    0   1   2   3
2   8   9  10  11
4  16  17  18  19
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3

- 치환 없이 일부만 임의선택하려면 Series나 DataFrame의 sample 메서드 이용

In [70]:
df.sample(n=3)

    0   1   2   3
0   0   1   2   3
2   8   9  10  11
4  16  17  18  19

- 반복선택을 허용하며 표본을 치환을 통해 생성하려면 sample에 replace = True

In [71]:
choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace=True)
draws

0    5
1    7
0    5
2   -1
1    7
1    7
1    7
2   -1
1    7
3    6
dtype: int64

#### 7.2.8 표시자/더미 변수 계산

- 통계 모형이나 머신러닝을 위한 또다른 데이터 변환은 더미나 표시자 행렬로 전환하는 것
- get_dummies 이용

In [72]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                   'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

- prefix 인자를 통해, 컬럼에 접두어를 추가한 후 다른 데이터와 병합 가능

In [74]:
dummies = pd.get_dummies(df['key'], prefix='key')
df_with_dummy = df[['data1']].join(dummies)
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [83]:
os.getcwd() #데이터 저장 드라이브 경로 지정

'/content/gdrive/My Drive/pydata-book'

- 한 row가 여러 범주에 속할 때

In [84]:
mnames = ['movie_id', 'title', 'genres']
movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                       header=None, names=mnames)
movies[:10]

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:3: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  This is separate from the ipykernel package so we can avoid doing imports until

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

- 데이터 묶음에서 유일한 장르 목록 추출

In [0]:
all_genres = []
for x in movies.genres:
    all_genres.extend(x.split('|'))
genres = pd.unique(all_genres)

In [86]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

- 표시자 DataFrame 생성을 위해 0으로 초기화된 DataFrame 생성

In [0]:
zero_matrix = np.zeros((len(movies), len(genres)))
dummies = pd.DataFrame(zero_matrix, columns=genres)

- 각 영화를 순회하면서 dummies 의 각 row 항목을 1로 설정. 
- 각 장르의 컬럼 색인을 계산하기 위해 dummies.columns 사용

In [88]:
gen = movies.genres[0]
gen.split('|')
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

- iloc를 이용하여 색인에 맞게 값 대입

In [0]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

- movies 와 조합

In [90]:
movies_windic = movies.join(dummies.add_prefix('Genre_'))
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

- get_dummies 와 cut 같은 이산함수를 조합하면 통계 애플리케이션에 유용하게 사용
  - 아래 예제는 값이 불변하도록 numpy.random.see 함수로 난수 시드값 지정

In [91]:
np.random.seed(12345)
values = np.random.rand(10)
values
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

#### 7.3 문자열 다루기
- 대부분의 텍스트 연산은 문자열 객체의 내장 메서드로 처리 가능하고, 보다 복잡한 패턴 매칭이나 텍스트 조작은 정규표현식 필요

#### 7.3.1 문자열 객체 메서드
- 쉼표는 spilt 메서드

In [92]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

- 공백을 없애는 strip 메서드와 조합해서 사용

In [93]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

- 더하기 연산을 사용하여 :: 문자열과 합치기(join 메서드가 더 보편적)

In [94]:
first, second, third = pieces
first + '::' + second + '::' + third

'a::b::guido'

In [95]:
'::'.join(pieces)

'a::b::guido'

- in 예약어로 일치하는 부분문자열 찾기

In [96]:
'guido' in val
val.index(',')
val.find(':')

-1

- find 와 index 의 차이점은 index 는 문자열을 찾기 못하면 예외 발생시킴. find는 -1 반환

In [97]:
val.index(':')

ValueError: ignored

- count는 부분 문자열 발견 횟수 반환

In [98]:
val.count(',')

2

- 찾아낸 패턴 치환
- 대체할 문자열로 비어이는 문자열을 넘겨서 패턴을 삭제하기 위해 자주 사용

In [99]:
val.replace(',', '::')
val.replace(',', '')

'ab  guido'

#### 7.3.2 정규표현식

In [0]:
import re

- 하나 이상의 공백 문자를 의미 \s+

In [101]:
text = "foo    bar\t baz  \tqux"
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

- re.compile 로 정규표현식 컴파일 후 객체를 재사용

In [102]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

- 매칭되는 모든 패턴은 findall

In [103]:
regex.findall(text)

['    ', '\t ', '  \t']

In [0]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE는 정규표현식이 대소문자를 가리지 않도록 함
regex = re.compile(pattern, flags=re.IGNORECASE)

In [105]:
#findall 로 이메일 주소 리스트 생성
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

- search 는 첫 번째 이메일 주소만 찾음
- match는 시작점과 끝 점 알려줌

In [107]:
m = regex.search(text)
print(m)
text[m.start():m.end()]

<_sre.SRE_Match object; span=(5, 20), match='dave@google.com'>

'dave@google.com'

In [108]:
print(regex.match(text)) #match는 시작점부터 일치하는지 검사

None

- sub 메서드는 찾은 패턴을 주어진 문자열로 치환한 후 새로운 문자열 반환

In [109]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

- 이메일 주소를 찾아서 동시에 각 이메일 주소를 사용자 이름, 도메인 이름, 도메인 접미사로 3개 컴포넌트로 나눠야 할 경우, 각 패턴을 괄호로 묶음

In [0]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'
regex = re.compile(pattern, flags=re.IGNORECASE)

- group 메서드로 각 패턴 컴포넌트의 튜플 획득

In [111]:
m = regex.match('wesm@bright.net')
m.groups()

('wesm', 'bright', 'net')

- 패턴에 그룹 존재 시 findall 메서드는 튜플의 목록 반환

In [112]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

- sub 역시 \1, \2 등으로 패턴 그룹 접근. \1은 첫번째, \2는 두번째로 찾은 그룹

In [113]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

#### 7.3.3 pandas의 벡터화된 문자열 함수

- 문자열을 담은 컬럼에 누락된 값이 있을 경우

In [114]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = pd.Series(data)
data
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

- Series에는 NA 를 건너뛰는 문자열 처리 메서드 존재
- str 속성 이용
- 각 이메일에 'gmail'이 포함되었는지 str.contains로 검사

In [115]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

- 정규표현식을 IGNORECASE와 같은 re 옵션과 함께 사용

In [116]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [117]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

- 벡터화된 요소는 str.get 혹은 str 속성 색인 이용

In [118]:
matches = data.str.match(pattern, flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

- 문자열 자르기

In [121]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object